jeffHODev/Hardware/hdyl/code/ele module/ele module_gd32_factory/Projects/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "gd32f10x.h"
/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "sensor.h"
#include "modbus.h"
#include "sys.h"
/* USER CODE END Includes */
extern uint32_t adc1_val_buf[2];
/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */
#if CPU ==ST
/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;
DMA_HandleTypeDef hdma_adc1;

IWDG_HandleTypeDef hiwdg;

TIM_HandleTypeDef htim3;

UART_HandleTypeDef huart1;
UART_HandleTypeDef huart2;
DMA_HandleTypeDef hdma_usart2_rx;
#endif
/* USER CODE BEGIN PV */
void rcu_config(void);
void timer_config(void);
void gpio_config(void);
void adc_config(void);
void gd_uart_init(void);
void nvic_config(void);
void gd_dma_init(void);
void wwdg_inint();

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_ADC1_Init(void);
static void MX_TIM3_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_IWDG_Init(void);
/* USER CODE BEGIN PFP */
uint32_t tick_usr1;
uint32_t led_tick;
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
    /* USER CODE BEGIN 1 */
    static unsigned char flag;
    /* USER CODE END 1 */
#if CPU ==ST
    /* MCU Configuration--------------------------------------------------------*/

    /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
    HAL_Init();

    /* USER CODE BEGIN Init */

    /* USER CODE END Init */

    /* Configure the system clock */
    SystemClock_Config();

    /* USER CODE BEGIN SysInit */

    /* USER CODE END SysInit */

    /* Initialize all configured peripherals */

    MX_GPIO_Init();
    MX_DMA_Init();
    MX_ADC1_Init();
    MX_TIM3_Init();
    MX_USART1_UART_Init();
    MX_USART2_UART_Init();
#else
    rcu_config();

		systick_config(); 
    gpio_config();
		timer_config();
    adc_config();
		
    gd_uart_init();
		gd_dma_init();
    nvic_config();
    

#endif

    /* USER CODE BEGIN 2 */
    params_Init();
		gpio_bit_write(LED1_GPIO_Port, LED1_Pin,RESET);
#if DEBUG == 0
    MX_IWDG_Init();
#endif
     
//        gpio_bit_write(Ele_ConA_GPIO_Port, Ele_ConA_Pin, SET);
//        delay_ms(20);
//        gpio_bit_write(Ele_ConB_GPIO_Port, Ele_ConB_Pin, RESET);
//        gpio_bit_write(Ele_ConA_GPIO_Port, Ele_ConA_Pin, RESET);
//        delay_ms(20);
//        gpio_bit_write(Ele_ConB_GPIO_Port, Ele_ConB_Pin, SET);				
				//	 rcu_all_reset_flag_clear();
    /* enable WWDGT clock */
  //  rcu_periph_clock_enable(RCU_WWDGT);
	//	fwdgt_config(0xfff, FWDGT_PSC_DIV128);
  //  fwdgt_enable();
    /* USER CODE END 2 */
 
 // test2();
    /* Infinite loop */
    /* USER CODE BEGIN WHILE */
    while (1)
    {
        /* USER CODE END WHILE */

		//	fwdgt_counter_reload();
      //sensor_process();
        //      ele_ctrl(ON);
			     timer_channel_output_pulse_value_config(TIMER2,TIMER_CH_2,0);
			RelayCtrl(FORWARD);
			delay_ms(5000);
      RelayCtrl(BACKWARD);
    // timer_channel_output_pulse_value_config(TIMER2,TIMER_CH_2,65535);
        timer_channel_output_pulse_value_config(TIMER2,TIMER_CH_2,50000);
				delay_ms(5000);
		 if(GetSensor()->ele_status==1)//电解时快闪
			led_tick = 300;
		else if(GetSensor()->online == 2)//修改地址1s闪烁
			led_tick = 1000;		
		else if(GetSensor()->online == 1)//在线2s慢闪
			led_tick = 2000;
    else
			led_tick = 0xffffffff;			
		if((HAL_GetTick()-tick_usr1)>=led_tick)
		{
		  tick_usr1 = HAL_GetTick();
			if(flag == 0)
			{
				flag = 1;
		    gpio_bit_write(LED1_GPIO_Port, LED1_Pin,SET);	
			}
			else
			{
					flag = 0;
		    gpio_bit_write(LED1_GPIO_Port, LED1_Pin,RESET);			
			}


		}
		gpio_bit_write(EN1_485_GPIO_Port, EN1_485_Pin, RESET);
	  ///    usart_data_transmit(USART0, 0x54);

    }
    /* USER CODE END 3 */
}
void wwdg_inint()
{
    /* check if the system has resumed from WWDGT reset */
    if(RESET != rcu_flag_get(RCU_FLAG_WWDGTRST)){
        /* WWDGTRST flag set */
        /* clear the WWDGTRST flag */
        rcu_all_reset_flag_clear();

    }
    /* enable WWDGT clock */
    rcu_periph_clock_enable(RCU_WWDGT);
    wwdgt_config(127, 80, WWDGT_CFG_PSC_DIV8);
    wwdgt_enable();

}
void adc_config(void)
{

	   /* reset ADC */
	   adc_deinit(ADC0);
	   /* ADC mode config */
	   adc_mode_config(ADC_MODE_FREE);
	   /* ADC contineous function enable */
	   adc_special_function_config(ADC0, ADC_CONTINUOUS_MODE, ENABLE);
	   /* ADC scan mode disable */
	   adc_special_function_config(ADC0, ADC_SCAN_MODE, ENABLE);
	   /* ADC data alignment config */
	   adc_data_alignment_config(ADC0, ADC_DATAALIGN_RIGHT);


	   /* ADC temperature and Vrefint enable */
	   adc_tempsensor_vrefint_enable();
	   
	   /* ADC channel length config */
	   adc_channel_length_config(ADC0, ADC_INSERTED_CHANNEL, 2);
	
	   /* ADC temperature sensor channel config */
	   adc_inserted_channel_config(ADC0, 0, ADC_CHANNEL_16, ADC_SAMPLETIME_239POINT5);
	   /* ADC internal reference voltage channel config */
	   adc_inserted_channel_config(ADC0, 1, ADC_CHANNEL_17, ADC_SAMPLETIME_239POINT5);
	
	   /* ADC trigger config */
	   adc_external_trigger_source_config(ADC0, ADC_INSERTED_CHANNEL, ADC0_1_2_EXTTRIG_INSERTED_NONE);



    /* ADC channel length config */
    adc_channel_length_config(ADC0, ADC_REGULAR_CHANNEL, 1);

